# Python Dictionaries with Pandas

<br/> <li> The capabilities of Pandas functions can be extended by using parameters.  
<br/> <li> For instance, the “read_csv” function has the “usecols” parameter that allows for reading a subset of columns in a CSV file.  
<br/> <li> Some functions have parameters that accept Python dictionaries as arguments, which adds further flexibility and expedites several operations.

## Exercise 1 - creating a DataFrame

In [1]:
import pandas as pd

df = pd.DataFrame(
    
    {
        "Group": ["A", "B", "B", "C", "A"],
        "Price": ["125", "100", "120", "36", "68"],
        "Weight": ["12.13", "16.21", "9.54", "7.99", "10.06"]
    }
    
)

In [2]:
df.dtypes

Group     object
Price     object
Weight    object
dtype: object

In [3]:
df

  Group Price Weight
0     A   125  12.13
1     B   100  16.21
2     B   120   9.54
3     C    36   7.99
4     A    68  10.06

## Exercise 2 - astype function

In [4]:
df["Price"] = df["Price"].astype("int")

df["Weight"] = df["Weight"].astype("float")

df.dtypes

Group      object
Price       int64
Weight    float64
dtype: object

## Exercise 3 - astype function with a dictionary

In [5]:
df = df.astype({"Price": "int32", "Weight": "float32"})

df.dtypes

Group      object
Price       int32
Weight    float32
dtype: object

In [6]:
df

  Group  Price     Weight
0     A    125  12.130000
1     B    100  16.209999
2     B    120   9.540000
3     C     36   7.990000
4     A     68  10.060000

## Exercise 4 - replace function

* Replace values given in to_replace with value.

In [7]:
df

  Group  Price     Weight
0     A    125  12.130000
1     B    100  16.209999
2     B    120   9.540000
3     C     36   7.990000
4     A     68  10.060000

In [8]:
df["Group"] = df["Group"].replace(to_replace="A", value=1)

df

  Group  Price     Weight
0     1    125  12.130000
1     B    100  16.209999
2     B    120   9.540000
3     C     36   7.990000
4     1     68  10.060000

## Exercise 5 - replace function with a dictionary

In [9]:
df["Group"] = df["Group"].replace(
    
    to_replace={"A": 1, "B": 2, "C": 3}
    
)

df

   Group  Price     Weight
0      1    125  12.130000
1      2    100  16.209999
2      2    120   9.540000
3      3     36   7.990000
4      1     68  10.060000

## Exercise 6 - replace function with a dictionary

In [10]:
df = pd.DataFrame(
    
    {
      "col_1": ["A", "B", "C", "D"],
      "col_2": ["A", "B", "E", "E"]
    }  
    
)

df

  col_1 col_2
0     A     A
1     B     B
2     C     E
3     D     E

In [11]:
df = df.replace( 
    
    to_replace={"A": 1, "B": 2, "C": 3, "D": 4, "E": 5}
    
)

df

   col_1  col_2
0      1      1
1      2      2
2      3      5
3      4      5

## Exercise 7 - regex parameter

* Whether to interpret to_replace and/or value as regular expressions. 
* If this is True then to_replace must be a string.

In [12]:
df = pd.DataFrame(

    {
      "col_1": ["A", "B", "C", "D"],
      "col_2": ["a", "b", "E", "E"]
    }
    
)

df

  col_1 col_2
0     A     a
1     B     b
2     C     E
3     D     E

In [13]:
df.replace({"A": 1, "B": 2, "C": 3, "D": 4, "E": 5})

   col_1 col_2
0      1     a
1      2     b
2      3     5
3      4     5

In [14]:
df

  col_1 col_2
0     A     a
1     B     b
2     C     E
3     D     E

In [15]:
df = df.replace(to_replace={"(?i)A": 1, "(?i)B": 2, "C": 3, "D": 4, "E": 5}, regex=True)

df

   col_1  col_2
0      1      1
1      2      2
2      3      5
3      4      5

## Exercise 8 - lower case and replace

In [16]:
ser = pd.Series(["cat", "Cat", "CAT", "Dog", "DOG"])

ser

0    cat
1    Cat
2    CAT
3    Dog
4    DOG
dtype: object

In [17]:
ser.str.lower().replace(to_replace={"cat": 1, "dog": 2})

0    1
1    1
2    1
3    2
4    2
dtype: int64

## Exercise 9 - replace function with nested dictionaries

In [18]:
df = pd.DataFrame(
    
    {
        "Group": ["A", "B", "B", "C"],
        "Profession": ["eng", "engineer", "doc", "doctor"]
    }
    
)

df

  Group Profession
0     A        eng
1     B   engineer
2     B        doc
3     C     doctor

In [19]:
df.replace(
    
    {
        "Group": {"A": 1, "B": 2, "C": 3},
        "Profession": {"eng": "engineer", "doc": "doctor"} 
    }

)

   Group Profession
0      1   engineer
1      2   engineer
2      2     doctor
3      3     doctor

## Exercise 10 - fillna function

In [20]:
df = pd.DataFrame(
    
    {
        "Group": ["A", "B", "B", "C"],
        "Price": [125, 100, 120, 36],
        "Weight": [12.13, 16.21, 9.54, 7.99]
    }
    
)

df.iloc[:2, :2] = None

df

  Group  Price  Weight
0  None    NaN   12.13
1  None    NaN   16.21
2     B  120.0    9.54
3     C   36.0    7.99

In [21]:
df["Group"].fillna("B")

0    B
1    B
2    B
3    C
Name: Group, dtype: object

In [22]:
df["Price"].fillna(100)

0    100.0
1    100.0
2    120.0
3     36.0
Name: Price, dtype: float64

## Exercise 11 - fillna function with a dictionary

In [23]:
df = df.fillna({"Group": "B", "Price": 100})

In [24]:
df

  Group  Price  Weight
0     B  100.0   12.13
1     B  100.0   16.21
2     B  120.0    9.54
3     C   36.0    7.99

## Exercise 12 - apply function

* The apply function is used for applying a function to the values in a data frame along an axis (i.e. rows or columns).

In [25]:
df["Price"] = df["Price"].apply(lambda x: x + 10)

df

  Group  Price  Weight
0     B  110.0   12.13
1     B  110.0   16.21
2     B  130.0    9.54
3     C   46.0    7.99

## Exercise 13 - apply function with a dictionary

In [26]:
df.apply({"Price": "mean", "Weight": "max"})

Price     99.00
Weight    16.21
dtype: float64

## Exercise 14 - apply function with a dictionary

In [27]:
df = df.apply(
    
    {"Price": lambda x: x + 10, "Weight": lambda x: x * 1.1}

)

df

   Price  Weight
0  120.0  13.343
1  120.0  17.831
2  140.0  10.494
3   56.0   8.789

## Exercise 15 - apply function with a dictionary

* Keep the group column

In [28]:
df = pd.DataFrame(
    
    {
        "Group": ["A", "B", "B", "C"],
        "Price": [125.13, 100.14, 120.28, 36.12],
        "Weight": [12.13, 16.21, 9.54, 7.99],
        "Sales": [110, 100, 135, 90]
    }
    
)

df

  Group   Price  Weight  Sales
0     A  125.13   12.13    110
1     B  100.14   16.21    100
2     B  120.28    9.54    135
3     C   36.12    7.99     90

In [29]:
cols = ["Price", "Weight"]

df[cols] = df[cols].apply(
    
    {"Price": lambda x: x + 1.2, "Weight": lambda x: x * 1.1}

)

df

  Group   Price  Weight  Sales
0     A  126.33  13.343    110
1     B  101.34  17.831    100
2     B  121.48  10.494    135
3     C   37.32   8.789     90

## Exercise 16 - round function

In [30]:
df.round()

  Group  Price  Weight  Sales
0     A  126.0    13.0    110
1     B  101.0    18.0    100
2     B  121.0    10.0    135
3     C   37.0     9.0     90

## Exercise 17 - round function with a dictionary

In [31]:
df.round({"Price": 1, "Weight": 2})

  Group  Price  Weight  Sales
0     A  126.3   13.34    110
1     B  101.3   17.83    100
2     B  121.5   10.49    135
3     C   37.3    8.79     90

## Exercise 18 - agg function with a dictionary

In [32]:
df.agg({"Price": "mean", "Sales": "sum"})

Price     96.6175
Sales    435.0000
dtype: float64